---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallJoinRoofFailures.NoFromRoofForWall
source: html/d021c5ee-5ceb-4ca1-0d0f-03c593b9df9a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallJoinRoofFailures.NoFromRoofForWall Property

Highlighted wall is set to be "From roof", however there is no roof below it that can be used.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoFromRoofForWall { get; }
```